# Create Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Pipe..::..Create Method
Pipe Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, ElementId, Connector, Connector) | Creates a new pipe that connects to two connectors. |
| Create(Document, ElementId, ElementId, Connector, XYZ) | Creates a new pipe that connects to the connector. |
| Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ) | Creates a new pipe from two points. |

# See Also
Pipe Class
Pipe Members
Autodesk.Revit.DB.Plumbing Namespace